#اعلام کتاب خانه
import numpy as np

a = np.array([1, 2, 3])   # ایجاد یک آرایه یک بعدی
print(type(a))            # نوع آرایه  "<class 'numpy.ndarray'>"
print(a.shape)            # شکل آرایه را چاپ می کند "(3,)"
print(a[0], a[1], a[2])   # مقادیر موجود در خانه های داده شده را چاپ می کند "1 2 3"
a[0] = 5                  # مقدار واقع در اولین خانه را چاپ می کند
print(a)                  # Prints "[5, 2, 3]"

b = np.array([[1,2,3],[4,5,6]])    # یک آرایه دو بعدی را چاپ می کند
print(b.shape)                     # شکل آرایه را چاپ می کند
print(b[0, 0], b[0, 1], b[1, 0])   # Prints "1 2 4"

