import numpy as np

#ارایه دو بعی با خانه هایی از نوع اعشاری
x = np.array([[1,2],[3,4]], dtype=np.float64)
y = np.array([[5,6],[7,8]], dtype=np.float64)
# جمع دو ماتریس تکه نتیجه، نتیجه خروجی زیر است
# [[ 6.0  8.0]
#  [10.0 12.0]]
print(x + y)
print(np.add(x, y))
# کسر دو آرایه از هم
# [[-4.0 -4.0]
#  [-4.0 -4.0]]
print(x - y)
print(np.subtract(x, y))
# ضرب نقطه به نقطه دو ماتریس در این ضرب باید دو ماتریس هم بعد باشند
# [[ 5.0 12.0]
#  [21.0 32.0]]
print(x * y)
print(np.multiply(x, y))
# تقسیم نقطه به نقطه دو ماتریس
# [[ 0.2         0.33333333]
#  [ 0.42857143  0.5       ]]
print(x / y)
print(np.divide(x, y))
# محاسبه جذر تک تک عناصر
# [[ 1.          1.41421356]
#  [ 1.73205081  2.        ]]
print(np.sqrt(x))